In [34]:
import pandas as pd

data = pd.read_csv(r"D:\Download\FINAL (2)\nba.csv")

sorted_data = data.sort_values(by='Age', ascending=True)

top_sorted = sorted_data.head()

print("First 5 Rows After Sorting by Age:")
print(top_sorted)

First 5 Rows After Sorting by Age:
                   Name                    Team  Number Position   Age Height  \
226       Rashad Vaughn         Milwaukee Bucks    20.0       SG  19.0    6-6
122        Devin Booker            Phoenix Suns     1.0       SG  19.0    6-6
40   Kristaps Porzingis         New York Knicks     6.0       PF  20.0    7-3
401          Tyus Jones  Minnesota Timberwolves     1.0       PG  20.0    6-2
427     Cliff Alexander  Portland Trail Blazers    34.0       PF  20.0    6-8

     Weight   College     Salary
226   202.0      UNLV  1733040.0
122   206.0  Kentucky  2127840.0
40    240.0       NaN  4131720.0
401   195.0      Duke  1282080.0
427   240.0    Kansas   525093.0

In [3]:
import pandas as pd

data_dict = {'Geeks': 10, 'for': 20, 'geeks': 30}

ser = pd.Series(data_dict)
print(ser)

Geeks    10
for      20
geeks    30
dtype: int64

In [4]:
import pandas as pd
ser = pd.Series(range(5, 15))
print(ser)

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64

In [5]:
print(data.describe())

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [6]:
desc = data["Name"].describe()

print(desc)

count               457
unique              457
top       Avery Bradley
freq                  1
Name: Name, dtype: object

In [7]:
data.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [19]:
# importing pandas module
import pandas as pd

# making data frame from csv file
data = pd.read_csv(r"D:\Download\FINAL (2)\nba.csv", index_col ="Name" )

# dropping passed values
data.drop(["Avery Bradley", "John Holland", "R.J. Hunter",
                            "R.J. Hunter"], inplace = True)

# display
data

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:

# dropping passed columns
data.drop(["Team", "Weight"], axis = 1,inplace=True)

# display
print(data)

              Name  Number Position   Age Height            College     Salary
0    Avery Bradley     0.0       PG  25.0    6-2              Texas  7730337.0
1      Jae Crowder    99.0       SF  25.0    6-6          Marquette  6796117.0
2     John Holland    30.0       SG  27.0    6-5  Boston University        NaN
3      R.J. Hunter    28.0       SG  22.0    6-5      Georgia State  1148640.0
4    Jonas Jerebko     8.0       PF  29.0   6-10                NaN  5000000.0
..             ...     ...      ...   ...    ...                ...        ...
453   Shelvin Mack     8.0       PG  26.0    6-3             Butler  2433333.0
454      Raul Neto    25.0       PG  24.0    6-1                NaN   900000.0
455   Tibor Pleiss    21.0        C  26.0    7-3                NaN  2900000.0
456    Jeff Withey    24.0        C  26.0    7-0             Kansas   947276.0
457            NaN     NaN      NaN   NaN    NaN                NaN        NaN

[458 rows x 7 columns]

In [12]:
import pandas as pd

# Create a simple DataFrame
data = {
    'Name': ['Asmi', 'Riya', 'Aditya', 'Neha'],
    'Age': [21, 22, 23, 24],
    'City': ['Bhopal', 'Indore', 'Delhi', 'Pune']
}
df = pd.DataFrame(data, index=['a', 'b', 'c', 'd'])

# Select a row using label
print(df.loc['b'])

Name      Riya
Age         22
City    Indore
Name: b, dtype: object

In [13]:
print(df.loc[['a', 'c']])

     Name  Age    City
a    Asmi   21  Bhopal
c  Aditya   23   Delhi

In [14]:
df.head()

     Name  Age    City
a    Asmi   21  Bhopal
b    Riya   22  Indore
c  Aditya   23   Delhi
d    Neha   24    Pune

In [15]:
print(df.iloc[1])      # Select the 2nd row (index starts at 0)
print(df.iloc[[0, 2]]) # Select 1st and 3rd rows

Name      Riya
Age         22
City    Indore
Name: b, dtype: object
     Name  Age    City
a    Asmi   21  Bhopal
c  Aditya   23   Delhi

In [20]:
list(df.columns)

['Name', 'Age', 'City']

In [21]:
for col in df.columns:
    print(col)

Name
Age
City

In [23]:
import pandas as pd
df = pd.DataFrame({'A': [10, 20], 'B': [30, 40], 'C': [50, 60]})
print(df.head())
df.rename(columns={'A': 'X', 'B': 'Y'}, inplace=True)
print(df)

    A   B   C
0  10  30  50
1  20  40  60
    X   Y   C
0  10  30  50
1  20  40  60

In [24]:
import pandas as pd

# Sample DataFrame
data = pd.DataFrame({
    'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
    'B': ['B1', 'B2', 'B3', 'B4', 'B5'],
    'C': ['C1', 'C2', 'C3', 'C4', 'C5']
})

# Syntax: df = df.drop('ColumnName', axis=1)


# Drop column 'B'
df = data.drop('B', axis=1)
print(df)

    A   C
0  A1  C1
1  A2  C2
2  A3  C3
3  A4  C4
4  A5  C5

In [25]:
import pandas as pd
data = {'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
        'B': ['B1', 'B2', 'B3', 'B4', 'B4'],
        'C': ['C1', 'C2', 'C3', 'C3', 'C3'],
        'D': ['D1', 'D2', 'D2', 'D2', 'D2'],
        'E': ['E1', 'E1', 'E1', 'E1', 'E1']}
        
df = pd.DataFrame(data)

unique_B = df['B'].unique()
print(unique_B)
print(df)

['B1' 'B2' 'B3' 'B4']
    A   B   C   D   E
0  A1  B1  C1  D1  E1
1  A2  B2  C2  D2  E1
2  A3  B3  C3  D2  E1
3  A4  B4  C3  D2  E1
4  A5  B4  C3  D2  E1

In [26]:
# You can also use ".apply()" to apply the lower() function to each element:


df['A'].apply(lambda x: x.lower())
df

    A   B   C   D   E
0  A1  B1  C1  D1  E1
1  A2  B2  C2  D2  E1
2  A3  B3  C3  D2  E1
3  A4  B4  C3  D2  E1
4  A5  B4  C3  D2  E1

In [28]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A': [1, -2, 3], 'B': [-1, 5, -6]})
df.head()
res = df.where(df > 0)
print(res)

     A    B
0  1.0  NaN
1  NaN  5.0
2  3.0  NaN

In [30]:
import pandas as pd
df = pd.DataFrame({'A': [1, -2, 3], 'B': [-1, 5, -6]})
print(df.head())
res = df.where(df > 0, other=0)
print(res)

   A  B
0  1 -1
1 -2  5
2  3 -6
   A  B
0  1  0
1  0  5
2  3  0

In [31]:
# importing pandas as pd
import pandas as pd

# Creating the dataframe
df = pd.DataFrame({"A":[12, 4, 5, None, 1],
                "B":[7, 2, 54, 3, None],
                "C":[20, 16, 11, 3, 8],
                "D":[14, 3, None, 2, 6]})

# skip the Na values while finding the mean
df.mean(axis = 1, skipna = True)

0    13.250000
1     6.250000
2    23.333333
3     2.666667
4     5.000000
dtype: float64

In [ ]:
import pandas as pd

data = {'Name': ['Asmi', 'Rahul', 'Sneha'],
        'Age': [21, 22, 20],
        'City': ['Bhopal', 'Indore', 'Pune']}

df = pd.DataFrame(data)
print(df)
df = df.set_index('Name')
print(df)

In [35]:
data.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [36]:
import pandas as pd  
# data = pd.read_csv("nba.csv")  

# iterate over rows
for i, row in data.head(2).iterrows():
    print(i, row)
    print()

0 Name         Avery Bradley
Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: 0, dtype: object

1 Name           Jae Crowder
Team        Boston Celtics
Number                99.0
Position                SF
Age                   25.0
Height                 6-6
Weight               235.0
College          Marquette
Salary           6796117.0
Name: 1, dtype: object

In [39]:
import pandas as pd  
# data = pd.read_csv("nba.csv")  

high_salary = []
for i, row in data.iterrows():
    s = row['Salary']
    if s > 5_000_000:
        high_salary.append((row['Name'], int(s)))

for name, sal in high_salary[:10]:
    print(f"{name} | {sal}")

Avery Bradley | 7730337
Jae Crowder | 6796117
Amir Johnson | 12000000
Isaiah Thomas | 6912869
Jarrett Jack | 6300000
Brook Lopez | 19689000
Thaddeus Young | 11235955
Arron Afflalo | 8000000
Carmelo Anthony | 22875000
Jose Calderon | 7402812

In [41]:
import pandas as pd

# Load DataFrame from CSV file
# data = pd.read_csv("nba.csv")
print("NBA Dataset:")
display(data.head())

# Sort the DataFrame by the 'Name' column in ascending order
data.sort_values("Name", axis=0, ascending=True, inplace=True, na_position='last')

# Display the sorted DataFrame
print("\nSorted DataFrame:")
display(data.head())

NBA Dataset:

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

Sorted DataFrame:

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
152,Aaron Brooks,Chicago Bulls,0.0,PG,31.0,6-0,161.0,Oregon,2250000.0
356,Aaron Gordon,Orlando Magic,0.0,PF,20.0,6-9,220.0,Arizona,4171680.0
328,Aaron Harrison,Charlotte Hornets,9.0,SG,21.0,6-6,210.0,Kentucky,525093.0
404,Adreian Payne,Minnesota Timberwolves,33.0,PF,25.0,6-10,237.0,Michigan State,1938840.0
312,Al Horford,Atlanta Hawks,15.0,C,30.0,6-10,245.0,Florida,12000000.0

In [42]:
import pandas as pd

data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd'],
         'Mobile No': [97, 91, 58, 76]}

data2 = {'Name': ['Gaurav', 'Anuj', 'Dhiraj', 'Hitesh'],
         'Age': [22, 32, 12, 52],
         'Address': ['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'],
         'Qualification': ['MCA', 'Phd', 'Bcom', 'B.hons'],
         'Salary': [1000, 2000, 3000, 4000]}

df = pd.DataFrame(data1, index=[0, 1, 2, 3])

df1 = pd.DataFrame(data2, index=[2, 3, 6, 7])

print(df, "\n\n", df1)

     Name  Age    Address Qualification  Mobile No
0     Jai   27     Nagpur           Msc         97
1  Princi   24     Kanpur            MA         91
2  Gaurav   22  Allahabad           MCA         58
3    Anuj   32    Kannuaj           Phd         76

      Name  Age    Address Qualification  Salary
2  Gaurav   22  Allahabad           MCA    1000
3    Anuj   32    Kannuaj           Phd    2000
6  Dhiraj   12  Allahabad          Bcom    3000
7  Hitesh   52    Kannuaj        B.hons    4000

In [43]:
res2 = pd.concat([df, df1], axis=1, join='inner')

res2

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
2,Gaurav,22,Allahabad,MCA,58,Gaurav,22,Allahabad,MCA,1000
3,Anuj,32,Kannuaj,Phd,76,Anuj,32,Kannuaj,Phd,2000

In [44]:
res = pd.concat([df, df1], ignore_index=True)
 
res

     Name  Age    Address Qualification  Mobile No  Salary
0     Jai   27     Nagpur           Msc       97.0     NaN
1  Princi   24     Kanpur            MA       91.0     NaN
2  Gaurav   22  Allahabad           MCA       58.0     NaN
3    Anuj   32    Kannuaj           Phd       76.0     NaN
4  Gaurav   22  Allahabad           MCA        NaN  1000.0
5    Anuj   32    Kannuaj           Phd        NaN  2000.0
6  Dhiraj   12  Allahabad          Bcom        NaN  3000.0
7  Hitesh   52    Kannuaj        B.hons        NaN  4000.0

In [56]:
import pandas as pd

# example dataframe
example = {'Team':['Australia', 'England', 'South Africa',
                   'Australia', 'England', 'India', 'India',
                        'South Africa', 'England', 'India'],
                        
           'Player':['Ricky Ponting', 'Joe Root', 'Hashim Amla',
                     'David Warner', 'Jos Buttler', 'Virat Kohli',
                     'Rohit Sharma', 'David Miller', 'Eoin Morgan',
                                                 'Dinesh Karthik'],
                                                 
          'Runs':[345, 336, 689, 490, 989, 672, 560, 455, 342, 376],
          
          'Salary':[34500, 33600, 68900, 49000, 98899,
                    67562, 56760, 45675, 34542, 31176] }

df = pd.DataFrame(example)

total_salary = df['Salary'].groupby(df['Team'])

# printing the means value
print(total_salary.mean())

Team
Australia       41750.000000
England         55680.333333
India           51832.666667
South Africa    57287.500000
Name: Salary, dtype: float64

In [ ]:
	1. Create a new DataFrame showing total monthly sales for each customer.
	 Identify customers with consecutive purchases for at least three months.

In [63]:
import pandas as pd

# Step 1ï¸: Create sample data
data = {
    'Customer': ['A','A','A','A','B','B','C','C','C','D','D'],
    'Month': ['2024-01','2024-02','2024-02','2024-03','2024-01','2024-03',
              '2024-02','2024-03','2024-04','2024-01','2024-02'],
    'Sales': [1000,1200,2000,1300,900,1100,800,950,1000,500,600]
}

df = pd.DataFrame(data)
df['Month'] = pd.to_datetime(df['Month'])   # ensure Month is datetime

print("Original Data:")
print(df)

Original Data:
   Customer      Month  Sales
0         A 2024-01-01   1000
1         A 2024-02-01   1200
2         A 2024-02-01   2000
3         A 2024-03-01   1300
4         B 2024-01-01    900
5         B 2024-03-01   1100
6         C 2024-02-01    800
7         C 2024-03-01    950
8         C 2024-04-01   1000
9         D 2024-01-01    500
10        D 2024-02-01    600

In [51]:
df['Year'] = df['Month'].dt.year
df['Month_no'] = df['Month'].dt.month

In [52]:
df.head()

  Customer      Month  Sales  Year  Month_no
0        A 2024-01-01   1000  2024         1
1        A 2024-02-01   1200  2024         2
2        A 2024-02-01   2000  2024         2
3        A 2024-03-01   1300  2024         3
4        B 2024-01-01    900  2024         1

In [55]:
monthly_sales  = (df.groupby(['Customer','Year','Month_no'])['Sales'].sum())
print(monthly_sales)

Customer  Year  Month_no
A         2024  1           1000
                2           3200
                3           1300
B         2024  1            900
                3           1100
C         2024  2            800
                3            950
                4           1000
D         2024  1            500
                2            600
Name: Sales, dtype: int64

In [57]:

	Identify customers with consecutive purchases for at least three months.

SyntaxError: invalid syntax (2984888692.py, line 1)

In [65]:
customers_with_consecutive = []

for customer, group in monthly_sales.groupby('Customer'):
    print(customer)
    months = group.sort_values(['Year', 'Month_no'])['Month_no'].tolist()
    count = 1 
    
    for i in range(1, len(months)):
        if months[i] - months[i-1] == 1:
            count += 1
            if count >= 3:
                customers_with_consecutive.append(customer)
                break
        else:
            count = 1

print("\nCustomers with 3+ consecutive monthly purchases:")
print(customers_with_consecutive)

A

TypeError: Series.sort_values() takes 1 positional argument but 2 were given

In [61]:
for customer, group in monthly_sales.groupby('Customer'):
    # Sort by Year and Month_no first (on the full DataFrame)
    group = group.sort_values(['Year', 'Month_no'])
    
    # Now extract the Month_no column as a list
    months = group['Month_no'].tolist()
    
    print(customer, months)

TypeError: Series.sort_values() takes 1 positional argument but 2 were given

In [64]:
df['Customer'].unique()

array(['A', 'B', 'C', 'D'], dtype=object)

In [ ]:
import pandas as pd

# Sample data
data = {
    'Customer': ['A','A','A','B','B','C','C','C'],
    'Year': [2024,2024,2024,2024,2024,2024,2024,2024],
    'Month_no': [1,2,3,1,4,5,6,8],
    'Sales': [200,300,250,100,150,400,300,500]
}

df = pd.DataFrame(data)

# Find customers with 3 consecutive months
customers_3_months = []
for customer in df['Customer'].unique():
    print(customer)
    # Get all months for the customer
    months = sorted(df[df['Customer'] == customer]['Month_no'].unique())
    print(len(months))
    print(months)
    count = 1  # to track consecutive sequence length
    
    for i in range(1, len(months)):
        # Check if current month is consecutive to previous
        if months[i] == months[i-1] + 1:
            count += 1
        else:
            count = 1  # reset count if gap found
        
        # If found 3 consecutive months
        if count >= 3:
            customers_3_months.append(customer)
            break  # no need to check more for this customer

print("Customers with purchases for 3 consecutive months:")
print(customers_3_months)

A
3
[np.int64(1), np.int64(2), np.int64(3)]
B
2
[np.int64(1), np.int64(4)]
C
3
[np.int64(5), np.int64(6), np.int64(8)]
Customers with purchases for 3 consecutive months:
['A']

In [74]:
df[df['Customer'] == 'A']

  Customer  Year  Month_no  Sales
0        A  2024         1    200
1        A  2024         2    300
2        A  2024         3    250

In [75]:
df[df['Customer'] == 'A']['Month_no']

0    1
1    2
2    3
Name: Month_no, dtype: int64

In [77]:
# 2. Calculate the quarterly sales for each product and find the product with the highest overall quarterly sales. 


import pandas as pd

# Sample data
data = {
    'Product': ['P1','P1','P1','P2','P2','P2','P3','P3','P3','P4','P4','P4'],
    'Month_no': [1,2,3,1,2,3,1,2,3,1,2,3],
    'Sales': [100, 150, 200, 80, 120, 160, 200, 250, 300, 90, 110, 130]
}

df = pd.DataFrame(data)

# Add Quarter column
df['Quarter'] = ((df['Month_no'] - 1) // 3) + 1

# Calculate quarterly sales for each product
quarterly_sales = df.groupby(['Product','Quarter'])['Sales'].sum().reset_index()
print("Quarterly sales per product:")
print(quarterly_sales)

# Calculate total sales per product
total_sales = df.groupby('Product')['Sales'].sum().reset_index()

# Find product with highest total sales
max_product = total_sales.loc[total_sales['Sales'].idxmax()]
print("\nProduct with highest total sales:")
print(max_product)

Quarterly sales per product:
  Product  Quarter  Sales
0      P1        1    450
1      P2        1    360
2      P3        1    750
3      P4        1    330

Product with highest total sales:
Product     P3
Sales      750
Name: 2, dtype: object

In [1]:
# import Pandas as pd
import pandas as pd
 
# create a new data frame
df = pd.DataFrame({'Name': ['John Larter', 'Robert Junior', 'Jonny Depp'],
                    'Age':[32, 34, 36]})
 
print("Given Dataframe is :\n",df)
 
# Adding two new columns to the existing dataframe.
# bydefault splitting is done on the basis of single space.
df[['First','Last']] = df.Name.str.split(expand=True)
 
print("\n After adding two new columns : \n", df)

Given Dataframe is :
             Name  Age
0    John Larter   32
1  Robert Junior   34
2     Jonny Depp   36

 After adding two new columns :
             Name  Age   First    Last
0    John Larter   32    John  Larter
1  Robert Junior   34  Robert  Junior
2     Jonny Depp   36   Jonny    Depp

In [2]:
data = {'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
        'Gender': ['M', 'F', 'M', 'F', 'M', 'F'],
        'Salary': [30000, 32000, 50000, 51000, 44000, 46000]}
df = pd.DataFrame(data)

result = df.groupby(['Department', 'Gender'])['Salary'].mean()
print(result)

Department  Gender
Finance     F         46000.0
            M         44000.0
HR          F         32000.0
            M         30000.0
IT          F         51000.0
            M         50000.0
Name: Salary, dtype: float64

In [3]:
result = df.groupby('Department')['Salary'].agg(['mean', 'min', 'max', 'count'])
print(result)

               mean    min    max  count
Department
Finance     45000.0  44000  46000      2
HR          31000.0  30000  32000      2
IT          50500.0  50000  51000      2

In [4]:
result = df.groupby('Department')['Salary'].agg(
    avg_salary='mean', lowest='min', highest='max')
print(result)

            avg_salary  lowest  highest
Department
Finance        45000.0   44000    46000
HR             31000.0   30000    32000
IT             50500.0   50000    51000

In [5]:
import pandas as pd

# Example DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
})

# Rename column 'A' to 'Age'
df = df.rename(columns={'A': 'Age'})
print(df)

   Age  B
0    1  4
1    2  5
2    3  6

In [6]:
df = df.rename(columns={'A': 'Age', 'B': 'Score'})
print(df)

   Age  Score
0    1      4
1    2      5
2    3      6

In [8]:
df.head()

   Age  Score
0    1      4
1    2      5
2    3      6

In [9]:
data = {'Department': ['HR', 'IT', 'Finance', 'IT', 'HR'],
        'Age': [25, 30, 28, 35, 32],
        'Salary': [30000, 50000, 40000, 52000, 31000]}
df = pd.DataFrame(data)

result = df.groupby('Department').agg({'Age': 'mean', 'Salary': ['min', 'max']})
print(result)

             Age Salary
            mean    min    max
Department
Finance     28.0  40000  40000
HR          28.5  30000  31000
IT          32.5  50000  52000

In [12]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [7, 8], 'B': [9, 10]})

result = pd.concat([df1, df2], ignore_index=True)
print(result)

   A   B
0  1   4
1  2   5
2  3   6
3  7   9
4  8  10

In [15]:
df3 = pd.DataFrame({'C': [11, 12, 13, 14, 15]})
result = pd.concat([df1, df3], axis=1)
print(result)

     A    B   C
0  1.0  4.0  11
1  2.0  5.0  12
2  3.0  6.0  13
3  NaN  NaN  14
4  NaN  NaN  15

In [16]:
employees = pd.DataFrame({'EmpID': [1, 2, 3],
                          'Name': ['Alice', 'Bob', 'Charlie'],
                          'DeptID': [101, 102, 101]})

departments = pd.DataFrame({'DeptID': [101, 102],
                            'DeptName': ['HR', 'IT']})

merged = pd.merge(employees, departments, on='DeptID', how='inner')
print(merged)

   EmpID     Name  DeptID DeptName
0      1    Alice     101       HR
1      2      Bob     102       IT
2      3  Charlie     101       HR

In [17]:
left = pd.DataFrame({'ID': [1, 2, 3], 'City': ['Delhi', 'Pune', 'Bhopal']})
right = pd.DataFrame({'Emp_ID': [1, 3, 4], 'Salary': [40000, 50000, 60000]})

merged = pd.merge(left, right, left_on='ID', right_on='Emp_ID', how='outer')
print(merged)

    ID    City  Emp_ID   Salary
0  1.0   Delhi     1.0  40000.0
1  2.0    Pune     NaN      NaN
2  3.0  Bhopal     3.0  50000.0
3  NaN     NaN     4.0  60000.0

In [21]:
import pandas as pd

# Step 1: Create a sample DataFrame
data = {
    'Department': ['HR', 'IT', 'Finance', 'HR', 'IT', 'Finance', 'HR'],
    'Salary': [30000, 50000, 45000, 31000, 52000, 46000, 33000]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

# Step 2: Calculate average salary for each department
avg_salary = df.groupby('Department')['Salary'].mean()
print("\nAverage salary by department:")
print(avg_salary)

# Step 3: Filter departments where average salary > 40000
high_salary_depts = avg_salary[avg_salary > 40000].index
print("\nDepartments with average salary > 40000:")
print(high_salary_depts)

# Step 4: Select only rows where department is in those high-salary departments
filtered_df = df[df['Department'].isin(high_salary_depts)]
print("\nFiltered DataFrame (only high-salary departments):")
print(filtered_df)

Original DataFrame:
  Department  Salary
0         HR   30000
1         IT   50000
2    Finance   45000
3         HR   31000
4         IT   52000
5    Finance   46000
6         HR   33000

Average salary by department:
Department
Finance    45500.000000
HR         31333.333333
IT         51000.000000
Name: Salary, dtype: float64

Departments with average salary > 40000:
Index(['Finance', 'IT'], dtype='object', name='Department')

Filtered DataFrame (only high-salary departments):
  Department  Salary
1         IT   50000
2    Finance   45000
4         IT   52000
5    Finance   46000